// Создать тест на 10 вопросов.Вопросы с вариантами ответа 1-то, 2-то, 3-то ,
// пользователь вводит только номер правильного, по его мнению, ответа.
// Пользователь отвечает на них последовательно и получает оценку по 12 балльной
// системе оценивания.
//     Например:
// Сколько будет 2+2?
//     1 - 5
//     2 - 3
//     3 - 4
//     4 - неизвестно
// введите номер ответа:
let questions1 = prompt("Кто такой Пётр первый?\n " +
    "Варианты ответов: \n " +
    "1 - Царь; \n " +
    "2 - Председатель колхоза; \n " +
    "3 - Агроном; \n " +
    "4 - Токарь фрезеровщик.", 0) == 1 ? true : false;
let questions1 = prompt("Кто такой Пётр первый?\n " +
    "Варианты ответов: \n " +
    "1 - Царь; \n " +
    "2 - Председатель колхоза; \n " +
    "3 - Агроном; \n " +
    "4 - Токарь фрезеровщик.", 0) == 1 ? true : false;

alert(questions1);